app/views/feed/_feed.html.erb

	    <%='Tags: '%>
		<% post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "relationships" ON "tags".id = "relationships".tag_id WHERE (("relationships".post_id = 53))