app/controllers/likes_controller.rb

  def like
    @post = Post.find(params[:id])

    if @post.likes == nil
      @post.likes = 1
      @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 15 ORDER BY posts.created_at DESC LIMIT 1
UPDATE "posts" SET "updated_at" = '2011-08-03 07:04:35.864550', "likes" = 3 WHERE "posts"."id" = 15

  def dislike
    @post = Post.find(params[:id])

    if @post.dislikes == nil
      @post.dislikes = 1
      @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 19 ORDER BY posts.created_at DESC LIMIT 1
UPDATE "posts" SET "updated_at" = '2011-08-03 07:01:33.692551', "dislikes" = 1 WHERE "posts"."id" = 20