app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (tags.tag_value LIKE '%why%') ORDER BY posts.created_at DESC

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY posts.created_at DESC LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY posts.created_at DESC LIMIT 1

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO "posts" ("likes", "picture_updated_at", "picture_file_name", "dislikes", "picture_content_type", "updated_at", "created_at", "content", "picture_file_size") VALUES (0, '2011-08-29 05:46:41.925551', 'IMG_0572.JPG', 0, 'image/jpeg', '2011-08-29 05:46:44.234690', '2011-08-29 05:46:44.234690', 'Testing a vertical image - this is going to look terrible', 1717277)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 17 ORDER BY posts.created_at DESC LIMIT 1
UPDATE "posts" SET "likes" = 8, "updated_at" = '2011-08-03 07:04:32.948077' WHERE "posts"."id" = 17

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 26 ORDER BY posts.created_at DESC LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 26