app/controllers/search_controller.rb

  def search
    @post_results = Post.search(params[:search])
---
SELECT "posts".* FROM "posts" WHERE (content LIKE '%hello%') ORDER BY posts.created_at DESC